app/views/users/show.html.erb

					<div class="margenes2">
					      <%= @user.categorias.map {|x| x.to_label}.join ', ' %>
---
SELECT `categorias`.* FROM `categorias` INNER JOIN `categorias_users` ON `categorias`.`id` = `categorias_users`.`categoria_id` WHERE `categorias_users`.`user_id` = 1