app/views/posts/index.html.erb

    <td><%= post.vistas %></td>
    <td><%= post.categorias.map {|x| x.to_label}.join ', ' %></td>
---
SELECT `categorias`.* FROM `categorias` INNER JOIN `categorias_posts` ON `categorias`.`id` = `categorias_posts`.`categoria_id` WHERE `categorias_posts`.`post_id` = 1