app/views/posts/show.html.erb

SELECT `categorias`.* FROM `categorias` INNER JOIN `categorias_posts` ON `categorias`.`id` = `categorias_posts`.`categoria_id` WHERE `categorias_posts`.`post_id` = 9
---
				  <b>Categoria:</b>
				  <%= @post.categorias.map {|x| x.to_label}.join ', ' %>

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`post_id` = 5 ORDER BY attending DESC
---
				  </tr>
				<% @comentarios = Comentario.find(:all, :order => "id DESC", :conditions =>{:post_id => @post.id}) %>