app/controllers/categorias_controller.rb

  def index
    @categorias = Categoria.all
---
SELECT `categorias`.* FROM `categorias`

  def show
    @categoria = Categoria.find(params[:id])
---
SELECT `categorias`.* FROM `categorias` WHERE `categorias`.`id` = 1 LIMIT 1

  def create
    @categoria = Categoria.new(params[:categoria])

    respond_to do |format|
      if @categoria.save
---
INSERT INTO `categorias` (`created_at`, `nombre`, `updated_at`) VALUES ('2012-04-25 04:39:12', 'Arquitectura', '2012-04-25 04:39:12')

  def destroy
    @categoria = Categoria.find(params[:id])
    @categoria.destroy
---
SELECT `categorias`.* FROM `categorias` WHERE `categorias`.`id` = 1 LIMIT 1
DELETE FROM `categorias` WHERE `categorias`.`id` = 1