app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT `comentarios`.* FROM `comentarios`

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1

  def edit
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1

  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`contenido`, `created_at`, `post_id`, `updated_at`, `user_id`) VALUES ('bdfbfdb', '2012-04-26 13:53:07', 5, '2012-04-26 13:53:07', 1)

  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1
UPDATE `comentarios` SET `contenido` = 'dsgkljsdgkdsajgksldgj', `updated_at` = '2012-04-27 14:16:37' WHERE `comentarios`.`id` = 2