app/controllers/posts_controller.rb

  def show
   @comentario = Comentario.new
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 9 LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`categoria_id`, `comentarios`, `created_at`, `current_session`, `descripcion`, `fotopost1_content_type`, `fotopost1_file_name`, `fotopost1_file_size`, `fotopost1_updated_at`, `gusta`, `nogusta`, `subtitulo`, `titulo`, `updated_at`, `user_id`, `vistas`) VALUES (NULL, NULL, '2012-04-29 22:39:40', NULL, 'fadsfas', 'image/png', 'Captura de pantalla 2012-02-10 a las 19.41.45.png', 404594, '2012-04-29 22:39:38', NULL, NULL, 'locaaa', 'la vida ', '2012-04-29 22:39:40', 1, NULL)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `user_id` = 2, `updated_at` = '2012-04-26 12:29:06' WHERE `posts`.`id` = 1

  def destroy
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1