app/controllers/users_controller.rb

def create
  @user = User.new(params[:user])

  # Saving without session maintenance to skip
  # auto-login which can't happen here because
  # the User has not yet been activated
  if @user.save_without_session_maintenance
---
INSERT INTO `users` (`about`, `active`, `apellido`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `ciudad`, `compania`, `created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `last_login_at`, `last_login_ip`, `last_request_at`, `login_count`, `name`, `nombre`, `pais`, `password_salt`, `perishable_token`, `persistence_token`, `prefe1`, `prefe2`, `prefe3`, `profesion`, `single_access_token`, `updated_at`, `web`) VALUES ('', 0, '', NULL, NULL, NULL, NULL, '', '', '2012-04-25 17:33:11', '3fa4a3b57361936d9166f236f635555b9f5c1d2b1431e58d78c862b67e747e90e49038d2099fa2b25bf2d105d3933dbc9f9a9ea775e85c11b596580b866f8447', NULL, NULL, 'ejemplo@ejemplo.com', 0, NULL, NULL, NULL, 0, 'josepa', '', '', 'hRdxObtUqc77gEvCAROq', 'VbddNEJI3S4rpHfM3z9', 'ea80bad5231dd87ab3faa1a6bd2850e1f824a5c973caa5ea2451007e5be6d078ed6806f70c535e444ac758ce989ddd1035dfff267ad2c5dfb8e67f401e4a992a', NULL, NULL, NULL, '', 'SQmGEWJJmqx4WEUwh8lr', '2012-04-25 17:33:11', '')

def activate
  @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)
---
SELECT `users`.* FROM `users` WHERE (perishable_token = '018UCGxNJoTDGrad24Xm' and updated_at > '2012-04-17 13:49:59') LIMIT 1

  def update
    @user = current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `avatar_file_name` = '220978_10150566552720150_610940149_18515379_1074148_o.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 324825, `avatar_updated_at` = '2012-04-25 23:39:10', `nombre` = '', `apellido` = '', `profesion` = '', `compania` = '', `web` = '', `pais` = '', `ciudad` = '', `about` = '', `perishable_token` = 'k5ru2cI3i0Okx5zQym3', `updated_at` = '2012-04-25 23:39:11' WHERE `users`.`id` = 1