app/controllers/user_sessions_controller.rb

def forgot_password_lookup_email
  if current_user
    redirect_to edit_account_url
  else
    user = User.find_by_email(params[:user_session][:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jpcompa@gmail.com' LIMIT 1